Дошкольное_учреждение83/src/InformationRegisters/удуГражданствоФизЛиц/удуГражданствоФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуГражданствоФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаПенсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеЯвляетсяНалоговымРезидентомРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаМедицинскоеСтрахование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуГражданствоФизЛиц/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.НеИмеетПравоНаМедицинскоеСтрахование <> СтрокаНабора.НеИмеетПравоНаПенсию Тогда
			СтрокаНабора.НеИмеетПравоНаМедицинскоеСтрахование = СтрокаНабора.НеИмеетПравоНаПенсию;
		КонецЕсли;
		
		Если СтрокаНабора.Страна.Пустая() Тогда
			СтрокаНабора.Страна = Справочники.СтраныМира.ЛицоБезГражданства;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
